In [4]:
import pandas as pd

# Example DataFrame
data = {'age': [25, 30, 35, 40],
        'salary': [50000, 60000, 70000, 80000]}
df = pd.DataFrame(data)

# Get descriptive statistics
df.describe()

             age        salary
count   4.000000      4.000000
mean   32.500000  65000.000000
std     6.454972  12909.944487
min    25.000000  50000.000000
25%    28.750000  57500.000000
50%    32.500000  65000.000000
75%    36.250000  72500.000000
max    40.000000  80000.000000

In [5]:
# Basic operations
# df.head(): Displays the first few rows of the DataFrame.
# df.tail(): Displays the last few rows.
# df.shape: Shows the number of rows and columns.
# df.columns: Displays the column names.
# df.describe(): Generates summary statistics for numerical columns.

In [8]:
data = {'age': [25, 30, 35, 40],
        'salary': [50000, 60000, 70000, 80000]}
df = pd.DataFrame(data)
df.head()
#df.head(): Displays the first few rows of the DataFrame.

   age  salary
0   25   50000
1   30   60000
2   35   70000
3   40   80000

In [9]:
df.tail()

   age  salary
0   25   50000
1   30   60000
2   35   70000
3   40   80000

In [11]:
df.shape

(4, 2)

In [15]:
df.columns

Index(['age', 'salary'], dtype='object')

In [16]:
df.describe()

             age        salary
count   4.000000      4.000000
mean   32.500000  65000.000000
std     6.454972  12909.944487
min    25.000000  50000.000000
25%    28.750000  57500.000000
50%    32.500000  65000.000000
75%    36.250000  72500.000000
max    40.000000  80000.000000

In [17]:
import pandas as pd
import numpy as np

In [18]:
# Creating a data frame
result = {'name':          ['Alpha','Bravo', 'Charlie','Delta','Echo','Foxtrot','Golf','Hotel','India','Juliet'],
          'roll':          [11,22,33,44,55,66,77,88,99,111],
          'python':        [78,67,89,90,91,72,76,89,67,85],
          'excel':         [89,87,67,74,78,90,76,78,90,54],
           'power_bi':     [45,67,89,87,67,90,65,67,56,90],
          'pandas':        [81,85,89,87,41,45,96,56,93,78],
        'machine_learning':[96,95,84,85,82,81,74,75,96,90],
         'statistics':     [67,48,45,98,75,71,70,60,90,93]}

df = pd.DataFrame(result)
df

,name,roll,python,excel,power_bi,pandas,machine_learning,statistics
0,Alpha,11,78,89,45,81,96,67
1,Bravo,22,67,87,67,85,95,48
2,Charlie,33,89,67,89,89,84,45
3,Delta,44,90,74,87,87,85,98
4,Echo,55,91,78,67,41,82,75
5,Foxtrot,66,72,90,90,45,81,71
6,Golf,77,76,76,65,96,74,70
7,Hotel,88,89,78,67,56,75,60
8,India,99,67,90,56,93,96,90
9,Juliet,111,85,54,90,78,90,93

In [22]:
df.columns = ['Name','Roll','Python','Excel','Power_bi','Pandas','Machine_learning','Statistics']
df.columns

Index(['Name', 'Roll', 'Python', 'Excel', 'Power_bi', 'Pandas',
       'Machine_learning', 'Statistics'],
      dtype='object')

In [23]:
df

,Name,Roll,Python,Excel,Power_bi,Pandas,Machine_learning,Statistics
0,Alpha,11,78,89,45,81,96,67
1,Bravo,22,67,87,67,85,95,48
2,Charlie,33,89,67,89,89,84,45
3,Delta,44,90,74,87,87,85,98
4,Echo,55,91,78,67,41,82,75
5,Foxtrot,66,72,90,90,45,81,71
6,Golf,77,76,76,65,96,74,70
7,Hotel,88,89,78,67,56,75,60
8,India,99,67,90,56,93,96,90
9,Juliet,111,85,54,90,78,90,93

In [24]:
df.rename(columns={'Roll':'Id', 'Statistics':"Stats"},inplace=True)
df

      Name   Id  Python  Excel  Power_bi  Pandas  Machine_learning  Stats
0    Alpha   11      78     89        45      81                96     67
1    Bravo   22      67     87        67      85                95     48
2  Charlie   33      89     67        89      89                84     45
3    Delta   44      90     74        87      87                85     98
4     Echo   55      91     78        67      41                82     75
5  Foxtrot   66      72     90        90      45                81     71
6     Golf   77      76     76        65      96                74     70
7    Hotel   88      89     78        67      56                75     60
8    India   99      67     90        56      93                96     90
9   Juliet  111      85     54        90      78                90     93

In [25]:
# Accessing a column
df['Excel']

0    89
1    87
2    67
3    74
4    78
5    90
6    76
7    78
8    90
9    54
Name: Excel, dtype: int64

In [26]:
df['Power_bi']

0    45
1    67
2    89
3    87
4    67
5    90
6    65
7    67
8    56
9    90
Name: Power_bi, dtype: int64

In [27]:
# Fancy index
df[  ['Excel', 'Stats']  ]

   Excel  Stats
0     89     67
1     87     48
2     67     45
3     74     98
4     78     75
5     90     71
6     76     70
7     78     60
8     90     90
9     54     93

In [28]:
df

      Name   Id  Python  Excel  Power_bi  Pandas  Machine_learning  Stats
0    Alpha   11      78     89        45      81                96     67
1    Bravo   22      67     87        67      85                95     48
2  Charlie   33      89     67        89      89                84     45
3    Delta   44      90     74        87      87                85     98
4     Echo   55      91     78        67      41                82     75
5  Foxtrot   66      72     90        90      45                81     71
6     Golf   77      76     76        65      96                74     70
7    Hotel   88      89     78        67      56                75     60
8    India   99      67     90        56      93                96     90
9   Juliet  111      85     54        90      78                90     93

In [29]:
# slicing 
df.loc[3:8,'Python':'Pandas']

   Python  Excel  Power_bi  Pandas
3      90     74        87      87
4      91     78        67      41
5      72     90        90      45
6      76     76        65      96
7      89     78        67      56
8      67     90        56      93